{
  "projects": [
    {
      "title": "Development of a workflow application and 3D web viewer",
      "projectInfo": "A workflow application and 3D web viewer that allows the users to view 3D models (JT format), manipulate the viewport, select relevant parts and then convert and export them in different formats.",
      "technologies": [
        "React",
        "JavaScript",
        "HTML",
        "CSS",
        "JT2Go from Siemens as a JT webviewer",
        "Node.js"
      ],
      "responsibilities": ["Front-end Software Development"]
    },
    {
      "title": "Development of a promotional web site",
      "projectInfo": "Promotional web site for a campaign of a producer of soft drinks. Features different information about the campaign with text, pictures and videos, displays various statistics and info charts and loads campaign data from 3rd party APIs.",
      "technologies": ["React", "HTML", "CSS", "REST APIs"],
      "responsibilities": [
        "Front-end Software Development",
        "Participation in Project Meetings"
      ]
    },
    {
      "title": "Smart solutions for monitoring the HVAC systems",
      "projectInfo": "Our partner develops smart solutions for monitoring the HVAC (Heating, ventilation and air conditioning) systems in commercial buildings and detecting anomalies. The platform supports property and maintenance managers in achieving user comfort, higher energy efficiency and fault free building services, using advanced data analytics and machine learning. The front-end part of the systems we’ve built from scratch. In the backend we created a scalable cloud architecture and implemented the integration with the buildings and the data collection. Based on the received information, the platform gives insights and actionable recommendations for enhanced equipment performance.",
      "technologies": ["React", "Node.js", "Nest.js", "Python", "AWS"],
      "responsibilities": [
        "Front-end Software Development",
        "Participation in Project Meetings"
      ]
    },
    {
      "title": "Publishing Portal",
      "projectInfo": "Development of a platform for scientists with reusable components that can be managed by their editors. The team created a set of modules like company description, testimonials, FAQ, partners, contacts and a special products module capable of doing JavaScript calculations on the fly. The platform supports multiple languages (English, German) and it was integrated with different third-party system like Salesforce and a Newsletter service.",
      "technologies": [
        "Bootstrap",
        "HTML",
        "CSS",
        "JavaScript, jQuery",
        "TYPO3 CMS"
      ],
      "responsibilities": [
        "Front-end Software Development",
        "CMS Development",
        "Participation in Project Meetings"
      ]
    },
    {
      "title": "Dedicated CMS Team for a client (under NDA)",
      "projectInfo": "Development of different websites, portals and landing pages for our client. One of the projects, for example, was developed for an international manufacturer of domestic appliance and consumer electronics. To meet their needs, our team created a multilingual TYPO3 enterprise website, which provides detailed information about our customer's line of products and solutions. The website features editable news, events and career sections, giving them the opportunity to easily add up data when necessary and a download page, where company brochures and manuals can be downloaded for more product information.",
      "technologies": [
        "WordPress",
        "TYPO3 CMS",
        "PHP",
        "JavaScript, jQuery",
        "HTML",
        "CSS"
      ],
      "responsibilities": [
        "Front-end Software Development",
        "CMS Development",
        "Participation in Project Meetings"
      ]
    },
    {
      "title": "Flexible website structure with customizable content elements",
      "projectInfo": "Our customer is a company offering holistic services for managers wanting to trigger, increase and apply the intrinsic ability of innovation. We built a flexible website structure based on customizable content elements using WordPress CMS and frontend templating.",
      "technologies": ["WordPress", "PHP", "JavaScript, jQuery", "HTML", "CSS"],
      "responsibilities": [
        "Front-end Software Development",
        "CMS Development",
        "Participation in Project Meetings"
      ]
    }
  ]
}
